#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shuuren/shuuren-alpha/runs/run-rCyqZVU2kzHF1dma

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.archive_file.signup: Reading...
data.archive_file.character: Reading...
data.archive_file.signup: Read complete after 0s [id=6c21b48943481d4f6cb249fab0eaaad0281afe57]
data.archive_file.character: Read complete after 0s [id=ac092c174ac7df6c790e91dac0747f53f3d2bfa4]
aws_iam_policy.signup_event_policy: Refreshing state... [id=arn:aws:iam::265390238424:policy/signup_event_policy]
aws_iam_role.signup_event_role: Refreshing state... [id=signup_event_role]
aws_iam_role.character_api_role: Refreshing state... [id=character_api_role]
aws_dynamodb_table.character: Refreshing state... [id=character]
aws_iam_policy.character_api_policy: Refreshing state... [id=arn:aws:iam::265390238424:policy/character_api_policy]
aws_acm_certificate.shuuren_cert: Refreshing state... [id=arn:aws:acm:us-east-1:265390238424:certificate/adf4603e-1f50-4653-b239-ade0bcb8362d]
aws_api_gateway_rest_api.shuuren_api_gateway_rest_api: Refreshing state... [id=kvf6m5r20e]
aws_api_gateway_resource.shuuren_api_character: Refreshing state... [id=041x8i]
aws_api_gateway_rest_api_policy.shuuren_api_policy: Refreshing state... [id=kvf6m5r20e]
aws_api_gateway_resource.shuuren_api_user: Refreshing state... [id=pbfffe]
aws_api_gateway_deployment.shuuren_api_deployment: Refreshing state... [id=habru0]
aws_api_gateway_method.shuuren_api_character_post: Refreshing state... [id=agm-kvf6m5r20e-041x8i-POST]
aws_api_gateway_method.shuuren_api_character_get: Refreshing state... [id=agm-kvf6m5r20e-041x8i-GET]
aws_api_gateway_stage.shuuren_api_stage: Refreshing state... [id=ags-kvf6m5r20e-api]
aws_api_gateway_method.shuuren_api_user_get: Refreshing state... [id=agm-kvf6m5r20e-pbfffe-GET]
aws_api_gateway_integration.shuuren_api_user_get_integration: Refreshing state... [id=agi-kvf6m5r20e-pbfffe-GET]
aws_acm_certificate_validation.shuuren_cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_api_gateway_domain_name.shuuren_api_gateway_custom_domain: Refreshing state... [id=api.shuuren.com]
aws_iam_role_policy_attachment.signup_event_policy_attachment: Refreshing state... [id=signup_event_role-20221007045500101300000001]
aws_lambda_function.signup_post_confirmation: Refreshing state... [id=signup_post_confirmation]
aws_iam_role_policy_attachment.character_api_policy_attachment: Refreshing state... [id=character_api_role-20221008005716699000000001]
aws_lambda_function.update_character: Refreshing state... [id=update_character]
aws_lambda_function.get_character: Refreshing state... [id=get_character]
aws_api_gateway_base_path_mapping.shuuren_api_mapping: Refreshing state... [id=api.shuuren.com/]
aws_cognito_user_pool.shuuren_user_pool: Refreshing state... [id=us-east-1_KFBySRRrW]
aws_lambda_permission.allow_get_character_api_gateway: Refreshing state... [id=AllowExecutionFromAPIGatewayCharacterGet]
aws_api_gateway_integration.get_character_integration: Refreshing state... [id=agi-kvf6m5r20e-041x8i-GET]
aws_lambda_permission.allow_api_gateway: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.update_character_integration: Refreshing state... [id=agi-kvf6m5r20e-041x8i-POST]
aws_lambda_permission.allow_cognito_post_confirmation: Refreshing state... [id=AllowExecutionFromCognito]
aws_cognito_user_pool_domain.shuuren_auth_domain: Refreshing state... [id=auth.shuuren.com]
aws_cognito_user_pool_client.shuuren_client: Refreshing state... [id=5t6dfe58g76h8vkmcfvb2o6keu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.shuuren_api_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "shuuren_api_deployment" {
      ~ created_date  = "2022-10-05T02:59:24Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:265390238424:kvf6m5r20e/" -> (known after apply)
      ~ id            = "habru0" -> (known after apply)
      ~ invoke_url    = "https://kvf6m5r20e.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "2843589bf8171cf3326b29cc0e4500fd277509b5" -> "f6ff9c6e3e7a51bd30037be0784566634c002a0d"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.shuuren_api_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "shuuren_api_stage" {
      ~ deployment_id         = "habru0" -> (known after apply)
        id                    = "ags-kvf6m5r20e-api"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.


```
</details>
*Pushed by: @rise-sudo, Action: `pull_request`*